@magodo Certainly:

```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azurerm_sentinel_alert_rule_ms_security_incident.sentinel_adrule: Refreshing state... [id=/subscriptions/65b049b9-f0f6-40ab-ae9d-0fef87935596/resourceGroups/siem_demo/providers/Microsoft.OperationalInsights/workspaces/Security-SIEM/providers/Microsoft.SecurityInsights/alertRules/ms-security-incident-alert-active-directory-v6]
azurerm_sentinel_alert_rule_ms_security_incident.sentinel_scrule: Refreshing state... [id=/subscriptions/65b049b9-f0f6-40ab-ae9d-0fef87935596/resourceGroups/siem_demo/providers/Microsoft.OperationalInsights/workspaces/Security-SIEM/providers/Microsoft.SecurityInsights/alertRules/ms-security-incident-alert-security-center-v6]
azurerm_sentinel_alert_rule_ms_security_incident.sentinel_atprule: Refreshing state... [id=/subscriptions/65b049b9-f0f6-40ab-ae9d-0fef87935596/resourceGroups/siem_demo/providers/Microsoft.OperationalInsights/workspaces/Security-SIEM/providers/Microsoft.SecurityInsights/alertRules/ms-security-incident-alert-threat-protection-v6]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_sentinel_alert_rule_ms_security_incident.sentinel_adrule must be replaced
-/+ resource "azurerm_sentinel_alert_rule_ms_security_incident" "sentinel_adrule" {
        display_name               = "Azure Sentinel Rule for Azure Active Directory created by Terraform"
      ~ display_name_filter        = [] -> (known after apply)
        enabled                    = true
      ~ id                         = "/subscriptions/65b049b9-f0f6-40ab-ae9d-0fef87935596/resourceGroups/siem_demo/providers/Microsoft.OperationalInsights/workspaces/Security-SIEM/providers/Microsoft.SecurityInsights/alertRules/ms-security-incident-alert-active-directory-v6" -> (known after apply)
      ~ log_analytics_workspace_id = "/subscriptions/65b049b9-f0f6-40ab-ae9d-0fef87935596/resourcegroups/siem_demo/providers/microsoft.operationalinsights/workspaces/security-siem" -> "/subscriptions/****/resourcegroups/siem_demo/providers/microsoft.operationalinsights/workspaces/Security-SIEM" # forces replacement
      ~ name                       = "ms-security-incident-alert-active-directory-v6" -> "ms-security-incident-alert-active-directory-v7" # forces replacement
        product_filter             = "Azure Active Directory Identity Protection"
        severity_filter            = [
            "High",
            "Low",
            "Medium",
        ]
      ~ text_whitelist             = [] -> (known after apply)
    }

  # azurerm_sentinel_alert_rule_ms_security_incident.sentinel_atprule must be replaced
-/+ resource "azurerm_sentinel_alert_rule_ms_security_incident" "sentinel_atprule" {
        display_name               = "Azure Sentinel Rule for Azure Advanced Threat Protection created by Terraform"
      ~ display_name_filter        = [] -> (known after apply)
        enabled                    = true
      ~ id                         = "/subscriptions/65b049b9-f0f6-40ab-ae9d-0fef87935596/resourceGroups/siem_demo/providers/Microsoft.OperationalInsights/workspaces/Security-SIEM/providers/Microsoft.SecurityInsights/alertRules/ms-security-incident-alert-threat-protection-v6" -> (known after apply)
      ~ log_analytics_workspace_id = "/subscriptions/65b049b9-f0f6-40ab-ae9d-0fef87935596/resourcegroups/siem_demo/providers/microsoft.operationalinsights/workspaces/security-siem" -> "/subscriptions/****/resourcegroups/siem_demo/providers/microsoft.operationalinsights/workspaces/Security-SIEM" # forces replacement
        name                       = "ms-security-incident-alert-threat-protection-v6"
        product_filter             = "Azure Advanced Threat Protection"
        severity_filter            = [
            "High",
            "Medium",
        ]
      ~ text_whitelist             = [] -> (known after apply)
    }

  # azurerm_sentinel_alert_rule_ms_security_incident.sentinel_scrule must be replaced
-/+ resource "azurerm_sentinel_alert_rule_ms_security_incident" "sentinel_scrule" {
        display_name               = "Azure Sentinel Rule for Security Center created by Terraform"
      ~ display_name_filter        = [] -> (known after apply)
        enabled                    = true
      ~ id                         = "/subscriptions/65b049b9-f0f6-40ab-ae9d-0fef87935596/resourceGroups/siem_demo/providers/Microsoft.OperationalInsights/workspaces/Security-SIEM/providers/Microsoft.SecurityInsights/alertRules/ms-security-incident-alert-security-center-v6" -> (known after apply)
      ~ log_analytics_workspace_id = "/subscriptions/65b049b9-f0f6-40ab-ae9d-0fef87935596/resourcegroups/siem_demo/providers/microsoft.operationalinsights/workspaces/security-siem" -> "/subscriptions/****/resourcegroups/siem_demo/providers/microsoft.operationalinsights/workspaces/Security-SIEM" # forces replacement
        name                       = "ms-security-incident-alert-security-center-v6"
        product_filter             = "Azure Security Center"
        severity_filter            = [
            "High",
            "Medium",
        ]
      ~ text_whitelist             = [] -> (known after apply)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

[tf.log](https://github.com/terraform-providers/terraform-provider-azurerm/files/5120873/tf.log)
